<!doctype html>
<html>
<head>
<meta charset="utf-8">
<title>Массивы</title>
</head>

<body>
	
	<?php
	//первый способ создания массива
	$name [0] = "Саша";
	$name [1] = "Маша";
	$name [2] = "Ваня";
	$name [3] = "Аня";
	$name [4] = "Костя";
	
	$h2 = count($name);
	echo($name[4]."</br>");
	
	//второй способ создания массива
	$name = array(0=>"Саша", 1=>"Маша",2=>"Ваня",3=>"Аня",4=>"Костя");
	
	echo($name[3]);
	
	echo "</br>В массиве \"name\" найдено - ".$h2." элементов";
	
	$w = " Ноутбук ";
	$w = trim($w);
	echo("</br>".$w);
	
	
	//если нумерация идет с 0, ее можно не указывать в обоих способах
	
	exit("</br><p> Работа программы прекращена на 29-й строке</p>");
	
	
	?>
</body>
</html>